{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "Sources": [
    {
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      },
      "Packages": [
        { "PackageIdentifier": "Git.Git" },
        { "PackageIdentifier": "GitHub.GitLFS" },
        { "PackageIdentifier": "GitHub.cli" },
        { "PackageIdentifier": "Microsoft.PowerShell" },
        { "PackageIdentifier": "Microsoft.WindowsTerminal" },
        { "PackageIdentifier": "Microsoft.VisualStudioCode" },
        { "PackageIdentifier": "ZedIndustries.Zed" },
        { "PackageIdentifier": "Microsoft.DotNet.SDK.10" },
        { "PackageIdentifier": "Rustlang.Rustup" },
        { "PackageIdentifier": "JetBrains.Toolbox" },
        { "PackageIdentifier": "M2Team.NanaZip" },
        { "PackageIdentifier": "gerardog.gsudo" },

        { "PackageIdentifier": "Neovim.Neovim" },
        { "PackageIdentifier": "tree-sitter.tree-sitter-cli" },
        { "PackageIdentifier": "Starship.Starship" },
        { "PackageIdentifier": "ajeetdsouza.zoxide" },
        { "PackageIdentifier": "Atuinsh.Atuin" },
        { "PackageIdentifier": "jdx.mise" },
        { "PackageIdentifier": "dandavison.delta" },
        { "PackageIdentifier": "eza-community.eza" },
        { "PackageIdentifier": "sharkdp.bat" },
        { "PackageIdentifier": "noborus.ov" },
        { "PackageIdentifier": "sharkdp.fd" },
        { "PackageIdentifier": "BurntSushi.ripgrep.MSVC" },
        { "PackageIdentifier": "junegunn.fzf" },
        { "PackageIdentifier": "jqlang.jq" },
        { "PackageIdentifier": "Clement.bottom" },
        { "PackageIdentifier": "koalaman.shellcheck" },
        { "PackageIdentifier": "ezwinports.make" },
        { "PackageIdentifier": "Ninja-build.Ninja" },
        { "PackageIdentifier": "Gyan.FFmpeg" }
      ]
    }
  ],
  "WinGetVersion": "1.11.400"
}
